; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 872305 1 3 4 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	image3 - mode
	Star1 - direction
	GroundStation0 - direction
	Star2 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(have_image Phenomenon3 image1)
	(have_image Planet4 image1)
	(have_image Star5 thermograph0)
	(have_image Star6 image1)
	(have_image Star7 image3)
))

)

; plan
1. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 star2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star2)
   goals met: 0 of 5
4. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 5
5. (turn_to satellite0 star7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
6. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 0 of 5
7. (take_image satellite0 star6 instrument1 image1)
   added: (have_image star6 image1)
   goals met: 1 of 5
8. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 1 of 5
9. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 1 of 5
10. (take_image satellite0 star5 instrument1 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 2 of 5
11. (turn_to satellite0 star7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star7)
   goals met: 2 of 5
12. (turn_to satellite0 planet4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet4)
   goals met: 2 of 5
13. (take_image satellite0 planet4 instrument1 image1)
   added: (have_image planet4 image1)
   goals met: 3 of 5
14. (turn_to satellite0 star7 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star7)
   goals met: 3 of 5
15. (turn_to satellite0 phenomenon3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon3)
   goals met: 3 of 5
16. (take_image satellite0 phenomenon3 instrument1 image1)
   added: (have_image phenomenon3 image1)
   goals met: 4 of 5
17. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 5
18. (turn_to satellite0 star7 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 star7)
   goals met: 4 of 5
19. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 5
20. (turn_to satellite0 groundstation0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 5
21. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 5
22. (turn_to satellite0 star7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star7)
   goals met: 4 of 5
23. (take_image satellite0 star7 instrument0 image3)
   added: (have_image star7 image3)
   goals met: 5 of 5
